Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 1024, 1024, 1)]   0         
_________________________________________________________________
conv2d (Conv2D)              (None, 1022, 1022, 30)    300       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 1020, 1020, 60)    16260     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 510, 510, 60)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 508, 508, 90)      48690     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 254, 254, 90)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 252, 252, 120)     97320     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 126, 126, 120)     0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 124, 124, 150)     162150    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 62, 62, 150)       0         
_________________________________________________________________
batch_normalization (BatchNo (None, 62, 62, 150)       600       
_________________________________________________________________
global_max_pooling2d (Global (None, 150)               0         
_________________________________________________________________
dropout (Dropout)            (None, 150)               0         
_________________________________________________________________
dense (Dense)                (None, 1024)              154624    
_________________________________________________________________
sieve_output (Dense)         (None, 1)                 1025      
=================================================================
Total params: 480,969
Trainable params: 480,669
Non-trainable params: 300
_________________________________________________________________
