Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1024, 1024,  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 1022, 1022, 3 300         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1020, 1020, 6 16260       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 510, 510, 60) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 508, 508, 90) 48690       max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 254, 254, 90) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 252, 252, 120 97320       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 126, 126, 120 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 124, 124, 150 162150      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 62, 62, 150)  0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 62, 62, 150)  600         max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
global_max_pooling2d (GlobalMax (None, 150)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dropout (Dropout)               (None, 150)          0           global_max_pooling2d[0][0]       
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         154624      dropout[0][0]                    
__________________________________________________________________________________________________
p10_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p16_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p25_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p50_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p75_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p84_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p90_output (Dense)              (None, 1)            1025        dense[0][0]                      
==================================================================================================
Total params: 487,119
Trainable params: 486,819
Non-trainable params: 300
__________________________________________________________________________________________________
