Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1536, 1536,  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 1534, 1534, 3 840         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1532, 1532, 6 16260       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 766, 766, 60) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 764, 764, 90) 48690       max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 382, 382, 90) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 380, 380, 120 97320       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 190, 190, 120 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 188, 188, 150 162150      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 94, 94, 150)  0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 94, 94, 150)  600         max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
global_max_pooling2d (GlobalMax (None, 150)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dropout (Dropout)               (None, 150)          0           global_max_pooling2d[0][0]       
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         154624      dropout[0][0]                    
__________________________________________________________________________________________________
p10_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p16_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p25_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p50_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p75_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p84_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
p90_output (Dense)              (None, 1)            1025        dense[0][0]                      
==================================================================================================
Total params: 487,659
Trainable params: 487,359
Non-trainable params: 300
__________________________________________________________________________________________________
