Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 1) 0                                            
__________________________________________________________________________________________________
separable_conv2d (SeparableConv (None, 510, 510, 30) 69          input_1[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_1 (SeparableCo (None, 508, 508, 60) 2130        separable_conv2d[0][0]           
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 254, 254, 60) 0           separable_conv2d_1[0][0]         
__________________________________________________________________________________________________
separable_conv2d_2 (SeparableCo (None, 252, 252, 90) 6030        max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 126, 126, 90) 0           separable_conv2d_2[0][0]         
__________________________________________________________________________________________________
separable_conv2d_3 (SeparableCo (None, 124, 124, 120 11730       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 62, 62, 120)  0           separable_conv2d_3[0][0]         
__________________________________________________________________________________________________
separable_conv2d_4 (SeparableCo (None, 60, 60, 150)  19230       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 30, 30, 150)  0           separable_conv2d_4[0][0]         
__________________________________________________________________________________________________
separable_conv2d_5 (SeparableCo (None, 28, 28, 180)  28530       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 14, 14, 180)  0           separable_conv2d_5[0][0]         
__________________________________________________________________________________________________
separable_conv2d_6 (SeparableCo (None, 12, 12, 210)  39630       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 6, 6, 210)    0           separable_conv2d_6[0][0]         
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 6, 6, 210)    840         max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
global_max_pooling2d (GlobalMax (None, 210)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dropout (Dropout)               (None, 210)          0           global_max_pooling2d[0][0]       
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         216064      dropout[0][0]                    
__________________________________________________________________________________________________
mean_output (Dense)             (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
sorting_output (Dense)          (None, 1)            1025        dense[0][0]                      
==================================================================================================
Total params: 326,303
Trainable params: 325,883
Non-trainable params: 420
__________________________________________________________________________________________________
