Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 768, 768, 1) 0                                            
__________________________________________________________________________________________________
separable_conv2d (SeparableConv (None, 766, 766, 30) 69          input_1[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_1 (SeparableCo (None, 764, 764, 60) 2130        separable_conv2d[0][0]           
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 382, 382, 60) 0           separable_conv2d_1[0][0]         
__________________________________________________________________________________________________
separable_conv2d_2 (SeparableCo (None, 380, 380, 90) 6030        max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 190, 190, 90) 0           separable_conv2d_2[0][0]         
__________________________________________________________________________________________________
separable_conv2d_3 (SeparableCo (None, 188, 188, 120 11730       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 94, 94, 120)  0           separable_conv2d_3[0][0]         
__________________________________________________________________________________________________
separable_conv2d_4 (SeparableCo (None, 92, 92, 150)  19230       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 46, 46, 150)  0           separable_conv2d_4[0][0]         
__________________________________________________________________________________________________
separable_conv2d_5 (SeparableCo (None, 44, 44, 180)  28530       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 22, 22, 180)  0           separable_conv2d_5[0][0]         
__________________________________________________________________________________________________
separable_conv2d_6 (SeparableCo (None, 20, 20, 210)  39630       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 10, 10, 210)  0           separable_conv2d_6[0][0]         
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 10, 10, 210)  840         max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
global_max_pooling2d (GlobalMax (None, 210)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dropout (Dropout)               (None, 210)          0           global_max_pooling2d[0][0]       
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         216064      dropout[0][0]                    
__________________________________________________________________________________________________
mean_output (Dense)             (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
sorting_output (Dense)          (None, 1)            1025        dense[0][0]                      
==================================================================================================
Total params: 326,303
Trainable params: 325,883
Non-trainable params: 420
__________________________________________________________________________________________________
