Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 768, 768, 1) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 766, 766, 30) 300         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 764, 764, 60) 16260       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 382, 382, 60) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 380, 380, 90) 48690       max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 190, 190, 90) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 188, 188, 120 97320       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 94, 94, 120)  0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 94, 94, 120)  480         max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
global_max_pooling2d (GlobalMax (None, 120)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dropout (Dropout)               (None, 120)          0           global_max_pooling2d[0][0]       
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         123904      dropout[0][0]                    
__________________________________________________________________________________________________
P10_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
P50_output (Dense)              (None, 1)            1025        dense[0][0]                      
__________________________________________________________________________________________________
P90_output (Dense)              (None, 1)            1025        dense[0][0]                      
==================================================================================================
Total params: 290,029
Trainable params: 289,789
Non-trainable params: 240
__________________________________________________________________________________________________
