Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 768, 768, 3)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 766, 766, 30)      840       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 764, 764, 60)      16260     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 382, 382, 60)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 380, 380, 90)      48690     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 190, 190, 90)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 188, 188, 120)     97320     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 94, 94, 120)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 92, 92, 150)       162150    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 46, 46, 150)       0         
_________________________________________________________________
batch_normalization (BatchNo (None, 46, 46, 150)       600       
_________________________________________________________________
global_max_pooling2d (Global (None, 150)               0         
_________________________________________________________________
dropout (Dropout)            (None, 150)               0         
_________________________________________________________________
dense (Dense)                (None, 1024)              154624    
_________________________________________________________________
d50_output (Dense)           (None, 1)                 1025      
=================================================================
Total params: 481,509
Trainable params: 481,209
Non-trainable params: 300
_________________________________________________________________
