Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 512, 512, 1)]     0         
_________________________________________________________________
separable_conv2d (SeparableC (None, 510, 510, 30)      69        
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 508, 508, 60)      2130      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 254, 254, 60)      0         
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 252, 252, 90)      6030      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 126, 126, 90)      0         
_________________________________________________________________
separable_conv2d_3 (Separabl (None, 124, 124, 120)     11730     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 62, 62, 120)       0         
_________________________________________________________________
separable_conv2d_4 (Separabl (None, 60, 60, 150)       19230     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 30, 30, 150)       0         
_________________________________________________________________
separable_conv2d_5 (Separabl (None, 28, 28, 180)       28530     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 14, 14, 180)       0         
_________________________________________________________________
separable_conv2d_6 (Separabl (None, 12, 12, 210)       39630     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 6, 6, 210)         0         
_________________________________________________________________
batch_normalization (BatchNo (None, 6, 6, 210)         840       
_________________________________________________________________
global_max_pooling2d (Global (None, 210)               0         
_________________________________________________________________
dropout (Dropout)            (None, 210)               0         
_________________________________________________________________
dense (Dense)                (None, 1024)              216064    
_________________________________________________________________
sieve_output (Dense)         (None, 1)                 1025      
=================================================================
Total params: 325,278
Trainable params: 324,858
Non-trainable params: 420
_________________________________________________________________
